Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
group1_conv2D (Conv2D)       (None, 224, 224, 16)      448       
_________________________________________________________________
group1_batch_norm (BatchNorm (None, 224, 224, 16)      64        
_________________________________________________________________
group1_activation (Activatio (None, 224, 224, 16)      0         
_________________________________________________________________
group1_max_pool2D (MaxPoolin (None, 112, 112, 16)      0         
_________________________________________________________________
group1_dropout (Dropout)     (None, 112, 112, 16)      0         
_________________________________________________________________
group2_conv2D (Conv2D)       (None, 112, 112, 32)      4640      
_________________________________________________________________
group2_batch_norm (BatchNorm (None, 112, 112, 32)      128       
_________________________________________________________________
group2_activation (Activatio (None, 112, 112, 32)      0         
_________________________________________________________________
group2_max_pool2D (MaxPoolin (None, 56, 56, 32)        0         
_________________________________________________________________
group2_dropout (Dropout)     (None, 56, 56, 32)        0         
_________________________________________________________________
group3_conv2D (Conv2D)       (None, 56, 56, 64)        18496     
_________________________________________________________________
group3_batch_norm (BatchNorm (None, 56, 56, 64)        256       
_________________________________________________________________
group3_activation (Activatio (None, 56, 56, 64)        0         
_________________________________________________________________
group3_max_pool2D (MaxPoolin (None, 28, 28, 64)        0         
_________________________________________________________________
group3_dropout (Dropout)     (None, 28, 28, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 50176)             0         
_________________________________________________________________
group5_dense (Dense)         (None, 64)                3211328   
_________________________________________________________________
group5_batch_norm (BatchNorm (None, 64)                256       
_________________________________________________________________
group5_activation (Activatio (None, 64)                0         
_________________________________________________________________
group5_dropout (Dropout)     (None, 64)                0         
_________________________________________________________________
group6_dense (Dense)         (None, 32)                2080      
_________________________________________________________________
group6_batch_norm (BatchNorm (None, 32)                128       
_________________________________________________________________
group6_activation (Activatio (None, 32)                0         
_________________________________________________________________
group6_dropout (Dropout)     (None, 32)                0         
_________________________________________________________________
group7_dense (Dense)         (None, 16)                528       
_________________________________________________________________
group7_batch_norm (BatchNorm (None, 16)                64        
_________________________________________________________________
group7_activation (Activatio (None, 16)                0         
_________________________________________________________________
group7_dropout (Dropout)     (None, 16)                0         
_________________________________________________________________
group8_dense (Dense)         (None, 8)                 136       
_________________________________________________________________
group8_batch_norm (BatchNorm (None, 8)                 32        
_________________________________________________________________
group8_activation (Activatio (None, 8)                 0         
_________________________________________________________________
group8_dropout (Dropout)     (None, 8)                 0         
_________________________________________________________________
dense (Dense)                (None, 3)                 27        
=================================================================
Total params: 3,238,611
Trainable params: 3,238,147
Non-trainable params: 464